profiling/stage_6/range_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 2.069ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.653ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 16.241ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 1.697ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.57ms    8.51ms 101.18ms   83.44%
    Req/Sec   523.03    316.55     4.08k    89.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.65ms
 75.000%    2.88ms
 90.000%   20.74ms
 99.000%   35.71ms
 99.900%   40.06ms
 99.990%   42.85ms
 99.999%  101.25ms
100.000%  101.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.304     0.000000            1         1.00
       0.881     0.100000         3720         1.11
       1.112     0.200000         7444         1.25
       1.304     0.300000        11145         1.43
       1.472     0.400000        14860         1.67
       1.647     0.500000        18580         2.00
       1.740     0.550000        20443         2.22
       1.848     0.600000        22298         2.50
       1.988     0.650000        24143         2.86
       2.207     0.700000        26014         3.33
       2.877     0.750000        27859         4.00
       4.715     0.775000        28786         4.44
       8.311     0.800000        29717         5.00
      12.415     0.825000        30646         5.71
      16.415     0.850000        31573         6.67
      18.959     0.875000        32501         8.00
      19.919     0.887500        32964         8.89
      20.735     0.900000        33433        10.00
      21.567     0.912500        33899        11.43
      22.415     0.925000        34361        13.33
      23.359     0.937500        34824        16.00
      23.919     0.943750        35054        17.78
      24.671     0.950000        35290        20.00
      25.599     0.956250        35518        22.86
      26.815     0.962500        35750        26.67
      28.255     0.968750        35983        32.00
      29.263     0.971875        36099        35.56
      30.127     0.975000        36214        40.00
      31.247     0.978125        36331        45.71
      32.303     0.981250        36446        53.33
      33.535     0.984375        36562        64.00
      34.303     0.985938        36623        71.11
      34.911     0.987500        36684        80.00
      35.391     0.989062        36737        91.43
      35.967     0.990625        36797       106.67
      36.639     0.992188        36854       128.00
      36.863     0.992969        36888       142.22
      37.087     0.993750        36910       160.00
      37.407     0.994531        36939       182.86
      37.791     0.995313        36969       213.33
      38.111     0.996094        37000       256.00
      38.207     0.996484        37015       284.44
      38.431     0.996875        37026       320.00
      38.687     0.997266        37042       365.71
      39.007     0.997656        37055       426.67
      39.231     0.998047        37071       512.00
      39.327     0.998242        37078       568.89
      39.455     0.998437        37084       640.00
      39.679     0.998633        37093       731.43
      39.935     0.998828        37101       853.33
      40.095     0.999023        37106      1024.00
      40.415     0.999121        37110      1137.78
      40.479     0.999219        37113      1280.00
      40.959     0.999316        37117      1462.86
      41.087     0.999414        37121      1706.67
      41.279     0.999512        37124      2048.00
      41.567     0.999561        37126      2275.56
      41.663     0.999609        37128      2560.00
      41.823     0.999658        37131      2925.71
      41.855     0.999707        37132      3413.33
      42.079     0.999756        37133      4096.00
      42.143     0.999780        37134      4551.11
      42.303     0.999805        37135      5120.00
      42.431     0.999829        37137      5851.43
      42.431     0.999854        37137      6826.67
      42.847     0.999878        37138      8192.00
      42.847     0.999890        37138      9102.22
      43.487     0.999902        37139     10240.00
      43.487     0.999915        37139     11702.86
      43.551     0.999927        37140     13653.33
      43.551     0.999939        37140     16384.00
      43.551     0.999945        37140     18204.44
      44.639     0.999951        37141     20480.00
      44.639     0.999957        37141     23405.71
      44.639     0.999963        37141     27306.67
      44.639     0.999969        37141     32768.00
      44.639     0.999973        37141     36408.89
     101.247     0.999976        37142     40960.00
     101.247     1.000000        37142          inf
#[Mean    =        5.571, StdDeviation   =        8.510]
#[Max     =      101.184, Total count    =        37142]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58645 requests in 30.20s, 15.30MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
  Non-2xx or 3xx responses: 3
Requests/sec:   1942.12
Transfer/sec:    518.75KB